profiling/stage-4_wrk_get.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 1.111ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.130ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.07ms  546.63us  13.60ms   76.84%
    Req/Sec   522.73     72.10     1.33k    82.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.02ms
 75.000%    1.30ms
 90.000%    1.65ms
 99.000%    2.41ms
 99.900%    5.99ms
 99.990%   12.31ms
 99.999%   13.61ms
100.000%   13.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.121     0.000000            1         1.00
       0.487     0.100000         5005         1.11
       0.652     0.200000        10007         1.25
       0.808     0.300000        14991         1.43
       0.927     0.400000        19996         1.67
       1.025     0.500000        25025         2.00
       1.074     0.550000        27510         2.22
       1.123     0.600000        30030         2.50
       1.174     0.650000        32492         2.86
       1.231     0.700000        34998         3.33
       1.300     0.750000        37509         4.00
       1.340     0.775000        38739         4.44
       1.386     0.800000        39985         5.00
       1.438     0.825000        41229         5.71
       1.498     0.850000        42475         6.67
       1.570     0.875000        43729         8.00
       1.609     0.887500        44362         8.89
       1.647     0.900000        44981        10.00
       1.690     0.912500        45608        11.43
       1.737     0.925000        46230        13.33
       1.794     0.937500        46854        16.00
       1.823     0.943750        47160        17.78
       1.863     0.950000        47475        20.00
       1.902     0.956250        47787        22.86
       1.940     0.962500        48099        26.67
       1.989     0.968750        48412        32.00
       2.017     0.971875        48571        35.56
       2.049     0.975000        48729        40.00
       2.089     0.978125        48880        45.71
       2.135     0.981250        49036        53.33
       2.185     0.984375        49192        64.00
       2.233     0.985938        49271        71.11
       2.291     0.987500        49347        80.00
       2.357     0.989062        49426        91.43
       2.453     0.990625        49503       106.67
       2.633     0.992188        49580       128.00
       2.779     0.992969        49619       142.22
       2.969     0.993750        49658       160.00
       3.237     0.994531        49697       182.86
       3.495     0.995313        49737       213.33
       3.835     0.996094        49775       256.00
       3.977     0.996484        49795       284.44
       4.239     0.996875        49814       320.00
       4.463     0.997266        49834       365.71
       4.647     0.997656        49853       426.67
       4.935     0.998047        49873       512.00
       5.187     0.998242        49883       568.89
       5.375     0.998437        49892       640.00
       5.571     0.998633        49902       731.43
       5.819     0.998828        49912       853.33
       6.075     0.999023        49922      1024.00
       6.251     0.999121        49927      1137.78
       6.447     0.999219        49931      1280.00
       6.695     0.999316        49936      1462.86
       7.099     0.999414        49941      1706.67
       7.395     0.999512        49946      2048.00
       7.839     0.999561        49949      2275.56
       8.207     0.999609        49951      2560.00
       8.607     0.999658        49953      2925.71
       8.999     0.999707        49956      3413.33
      10.895     0.999756        49958      4096.00
      11.631     0.999780        49960      4551.11
      11.695     0.999805        49961      5120.00
      11.879     0.999829        49962      5851.43
      11.887     0.999854        49963      6826.67
      12.087     0.999878        49964      8192.00
      12.311     0.999890        49965      9102.22
      12.455     0.999902        49966     10240.00
      12.455     0.999915        49966     11702.86
      12.879     0.999927        49968     13653.33
      12.879     0.999939        49968     16384.00
      12.879     0.999945        49968     18204.44
      12.879     0.999951        49968     20480.00
      12.879     0.999957        49968     23405.71
      13.015     0.999963        49969     27306.67
      13.015     0.999969        49969     32768.00
      13.015     0.999973        49969     36408.89
      13.015     0.999976        49969     40960.00
      13.015     0.999979        49969     46811.43
      13.607     0.999982        49970     54613.33
      13.607     1.000000        49970          inf
#[Mean    =        1.067, StdDeviation   =        0.547]
#[Max     =       13.600, Total count    =        49970]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59990 requests in 1.00m, 5.05MB read
Requests/sec:    999.89
Transfer/sec:     86.22KB